* 補完 / 絞り込み

  #+BEGIN_SRC emacs-lisp
    (use-package recentf
      :ensure t
      :config
      (setq recentf-max-saved-items 2000) ;; 2000ファイルまで履歴保存する
      (setq recentf-auto-cleanup 'never)  ;; 存在しないファイルは消さない
      (setq recentf-exclude '("/recentf" "COMMIT_EDITMSG" "/.?TAGS" "^/sudo:" "/\\.emacs\\.d/games/*-scores" "/\\.emacs\\.d/\\.cask/"))
      (setq recentf-auto-save-timer (run-with-idle-timer 12000 t 'recentf-save-list))
      (recentf-mode 1))


    (use-package popper
      :ensure t ; or :straight t
      :bind (("C-`"   . popper-toggle)
             ("M-`"   . popper-cycle)
             ("C-M-`" . popper-toggle-type))
      :init
      (setq popper-reference-buffers
            '("\\*Messages\\*"
              "Output\\*$"
              "\\*Async Shell Command\\*"
              org-journal-mode
              help-mode
              compilation-mode))
      (popper-mode +1)
      (setq popper-window-height 20)
      (popper-echo-mode +1))                ; For echo area hints


    (use-package ace-window
      :straight t
      :bind (("C-t". ace-window)))

    ;; ;; https://www.emacs.dyerdwelling.family/emacs/20231221210441-emacs--selected-window-accent/
    ;; (defun my/selected-window-accent ()
    ;;   (interactive)
    ;;   (set-face-background 'fringe "#77002e")
    ;;   (walk-windows
    ;;    (lambda (window)
    ;;      (if (eq window (selected-window))
    ;;          (progn
    ;;            (set-window-margins window 1 0)
    ;;            (set-window-fringes window 8 0 t nil))
    ;;        (progn
    ;;          (set-window-margins window 3 0)
    ;;          (set-window-fringes window 0 0 t nil))
    ;;        )
    ;;      )
    ;;    nil t))

    ;; (add-hook 'window-state-change-hook 'my/selected-window-accent)

    (use-package projectile
      :ensure t
      :diminish projectile-mode
      :config
      (projectile-mode +1)
      (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
      (setq projectile-indexing-method 'alien)
      (setq projectile-project-search-path '("~/projects"))
      (projectile-discover-projects-in-search-path))

                                            ; (use-package selectrum
                                            ;   :straight t
                                            ;   :config
                                            ;   (selectrum-mode +1))
    (use-package vertico
      :straight t
      :init
      (vertico-mode)

      ;; Different scroll margin
      (setq vertico-scroll-margin 0)

      ;; Show more candidates
      (setq vertico-count 20)

      ;; Grow and shrink the Vertico minibuffer
      (setq vertico-resize t)

      ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
      (setq vertico-cycle t))
    ;; Migemoを有効にする
    ;; https://github.com/yamatakau08/.emacs.d/blob/master/.orderless.el
    (use-package orderless
      :straight t

      :custom
      ;;(completion-styles '(orderless))
      (completion-styles '(orderless basic))
      (orderless-matching-styles '(orderless-regexp))
      (completion-category-overrides '((file (styles basic partial-completion))))
      ;;(orderless-matching-styles '(orderless-literal orderless-regexp))
      ;;(orderless-matching-styles '(orderless-literal orderless-regexp))

      :config
      ;; supported emacs-jp slack
      (setq orderless-matching-styles '(orderless-migemo))
      ;;(setq orderless-matching-styles '(orderless-literal orderless-regexp orderless-migemo)) ; move to :custom block
      ;;(defalias 'orderless-migemo #'migemo-get-pattern)

      (defun orderless-migemo (component)
        (let ((pattern (migemo-get-pattern component)))
          ;;(message component)
          (condition-case nil
              (progn (string-match-p pattern "") pattern)
            (invalid-regexp nil))))

      (defun orderless-migemo (component)
        (if (>= (length component) 4)
            (let ((pattern (migemo-get-pattern component)))
              (condition-case nil
                  (progn (string-match-p pattern "") pattern)
                (invalid-regexp nil)))
          component)))
    ;;(use-package marginalia
    ;;
    ;;  :config
    ;;  (marginalia-mode))
    ;; Enable richer annotations using the Marginalia package
    (use-package marginalia
      :straight t

      ;; Either bind `marginalia-cycle` globally or only in the minibuffer
      :bind (("M-A" . marginalia-cycle)
             :map minibuffer-local-map
             ("M-A" . marginalia-cycle))

      ;; The :init configuration is always executed (Not lazy!)
      :init

      ;; Must be in the :init section of use-package such that the mode gets
      ;; enabled right away. Note that this forces loading the package.
      (marginalia-mode)
      :config
      (add-to-list 'marginalia-prompt-categories
                   '("\\<File\\>" . file)))

    (use-package consult
      :straight t
      ;; Replace bindings. Lazily loaded due by `use-package'.
      :bind (;; C-c bindings (mode-specific-map)
             ("C-c h" . consult-history)
             ("C-c m" . consult-mode-command)
             ("C-c b" . consult-bookmark)
             ("C-c k" . consult-kmacro)
             ;; C-x bindings (ctl-x-map)
             ("C-x M-:" . consult-complex-command)     ;; orig. repeat-complex-command
             ("C-x b" . consult-buffer)                ;; orig. switch-to-buffer
             ("C-x 4 b" . consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
             ("C-x 5 b" . consult-buffer-other-frame)  ;; orig. switch-to-buffer-other-frame
             ;; Custom M-# bindings for fast register access
             ("M-#" . consult-register-load)
             ("M-'" . consult-register-store)          ;; orig. abbrev-prefix-mark (unrelated)
             ("C-M-#" . consult-register)
             ;; Other custom bindings
             ("M-y" . consult-yank-pop)                ;; orig. yank-pop
             ("<help> a" . consult-apropos)            ;; orig. apropos-command
             ;; M-g bindings (goto-map)
             ("M-g e" . consult-compile-error)
             ("M-g f" . consult-flymake)               ;; Alternative: consult-flycheck
             ("M-g g" . consult-goto-line)             ;; orig. goto-line
             ("M-g M-g" . consult-goto-line)           ;; orig. goto-line
             ("M-g o" . consult-outline)               ;; Alternative: consult-org-heading
             ("M-g m" . consult-mark)
             ("M-g k" . consult-global-mark)
             ("M-g i" . consult-imenu)
             ("M-g I" . consult-imenu-multi)
             ;; M-s bindings (search-map)
             ("M-s f" . consult-find)
             ("M-s L" . consult-locate)
             ("M-s g" . consult-grep)
             ("M-s G" . consult-git-grep)
             ("M-s r" . consult-ripgrep)
             ("M-s l" . consult-line)
             ("M-s m" . consult-multi-occur)
             ("M-s k" . consult-keep-lines)
             ("M-s u" . consult-focus-lines)
             ;; Isearch integration
             ("C-s" . ks/consult-line)
             ("M-s e" . consult-isearch)
             :map isearch-mode-map
             ("M-e" . consult-isearch)                 ;; orig. isearch-edit-string
             ("M-s e" . consult-isearch)               ;; orig. isearch-edit-string
             ("M-s l" . consult-line))                 ;; needed by consult-line to detect isearch

      ;; Enable automatic preview at point in the *Completions* buffer.
      ;; This is relevant when you use the default completion UI,
      ;; and not necessary for Vertico, Selectrum, etc.
      :hook (completion-list-mode . consult-preview-at-point-mode)

      ;; The :init configuration is always executed (Not lazy)
      :init
      ;; consult-line のリージョン対応
      (defun ks/consult-line ()
        "Consult-line uses things-at-point if set C-u prefix."
        (interactive)
        (if (region-active-p)
            (let ((reg (buffer-substring-no-properties (region-beginning) (region-end))))
              (deactivate-mark)
              (consult-line reg))
          (consult-line)))

      ;; Optionally configure the register formatting. This improves the register
      ;; preview for `consult-register', `consult-register-load',
      ;; `consult-register-store' and the Emacs built-ins.
      (setq register-preview-delay 0
            register-preview-function #'consult-register-format)

      ;; Optionally tweak the register preview window.
      ;; This adds thin lines, sorting and hides the mode line of the window.
      (advice-add #'register-preview :override #'consult-register-window)

      ;; Optionally replace `completing-read-multiple' with an enhanced version.
      ;;(advice-add #'completing-read-multiple :override #'consult-completing-read-multiple)

      ;; Use Consult to select xref locations with preview
      (setq xref-show-xrefs-function #'consult-xref
            xref-show-definitions-function #'consult-xref)
      ;; Consult-ripgrep の Migemo 対応
      (defvar consult--migemo-regexp "")
      (defun consult--migemo-regexp-compiler (input type ignore-case)
        (setq consult--migemo-regexp
              (mapcar #'migemo-get-pattern (consult--split-escaped input)))
        (cons (mapcar (lambda (x) (consult--convert-regexp x type))
                      consult--migemo-regexp)
              (lambda (str)
                (consult--highlight-regexps consult--migemo-regexp str))))
      ;; (setq consult--regexp-compiler #'consult--migemo-regexp-compiler)


      ;; Configure other variables and modes in the :config section,
      ;; after lazily loading the package.
      :config
      
      ;; Optionally configure preview. The default value
      ;; is 'any, such that any key triggers the preview.
      ;; (setq consult-preview-key 'any)
      ;; (setq consult-preview-key (kbd "M-."))
      ;; (setq consult-preview-key (list (kbd "<S-down>") (kbd "<S-up>")))
      ;; For some commands and buffer sources it is useful to configure the
      ;; :preview-key on a per-command basis using the `consult-customize' macro.
      (consult-customize
       consult-theme :preview-key '(:debounce 0.2 any)
       ;;       consult-ripgrep consult-git-grep consult-grep
       ;;       consult-bookmark consult-recent-file consult-xref
       ;;       consult--source-file consult--source-project-file consult--source-bookmark

       consult-ripgrep consult-git-grep consult-grep
       consult-bookmark consult-recent-file consult-xref
       consult--source-bookmark consult--source-recent-file
       consult--source-project-recent-file
       :preview-key '(:debounce 0.2 any))
                                            ;    :preview-key "M-.")

      ;; Optionally configure the narrowing key.
      ;; Both < and C-+ work reasonably well.
      (setq consult-narrow-key "<") ;; (kbd "C-+")

      ;; Optionally make narrowing help available in the minibuffer.
      ;; You may want to use `embark-prefix-help-command' or which-key instead.
      ;; (define-key consult-narrow-map (vconcat consult-narrow-key "?") #'consult-narrow-help)

      ;; Optionally configure a function which returns the project root directory.
      ;; There are multiple reasonable alternatives to chose from.
                 ;;;; 1. project.el (project-roots)
      (setq consult-project-root-function
            (lambda ()
              (when-let (project (project-current))
                (car (project-roots project)))))
                 ;;;; 2. projectile.el (projectile-project-root)
      ;; (autoload 'projectile-project-root "projectile")
      ;; (setq consult-project-root-function #'projectile-project-root)
                 ;;;; 3. vc.el (vc-root-dir)
      ;; (setq consult-project-root-function #'vc-root-dir)
                 ;;;; 4. locate-dominating-file
      ;; (setq consult-project-root-function (lambda () (locate-dominating-file "." ".git")))

      ;; C-x b の consult-buffer に recentf を追加する
      ;; https://tam5917.hatenablog.com/entry/2021/04/29/235949
      (setq consult--source-file
            `(:name     "File"
                        :narrow   ?f
                        :category file
                        :face     consult-file
                        :history  file-name-history
                        :action   ,#'consult--file-action
                        :enabled   ,(lambda () recentf-mode)
                        :items ,recentf-list))

      )

    (use-package embark
      :straight t

      :bind
      (("C-." . embark-act)         ;; pick some comfortable binding
       ("C-;" . embark-dwim)        ;; good alternative: M-.
       ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'

      :init

      ;; Optionally replace the key help with a completing-read interface
      (setq prefix-help-command #'embark-prefix-help-command)
      ;; 
      (setq embark-help-key "?")

      :config

      ;; Hide the mode line of the Embark live/completions buffers
      (add-to-list 'display-buffer-alist
                   '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                     nil
                     (window-parameters (mode-line-format . none)))))

    ;; Consult users will also want the embark-consult package.
    (use-package embark-consult
      :straight t
      :hook
      (embark-collect-mode . consult-preview-at-point-mode))
  #+END_SRC

  #+RESULTS:
  | embark-consult--upgrade-markers | consult-preview-at-point-mode |



** Lisp
#+begin_src emacs-lisp
  (use-package lispy
    :straight t
    :hook (emacs-lisp-mode . (lambda () (lispy-mode 1)))
    :hook (lisp-mode . (lambda () (lispy-mode 1))))
#+end_src

#+RESULTS:
| (closure (font-lock-end font-lock-beg sly-fontifying-fu--contrib sly-fontifying-fu--path t) nil (add-hook 'font-lock-extend-region-functions 'sly-extend-region-for-font-lock t t)) | sly--lisp-indent-lisp-mode-hook | sly-editing-mode | (lambda nil (lispy-mode 1)) |
| (lambda nil (lispy-mode 1))                                                                                                                                                         | sly-editing-mode                |                  |                             |

#+begin_src emacs-lisp
  (load (expand-file-name "~/.roswell/helper.el"))
  ;;(setq inferior-lisp-program "ros -Q run")

  (use-package sly-overlay
    :straight (:host sourcehut :repo "fosskers/sly-overlay"))
#+end_src

